# Relatório de Análise V

## Tratamento de Dados Faltantes

## Identificação de alguns problemas na base

In [1]:
import pandas as pd #importando pandas

In [3]:
dados = pd.read_csv('dados/aluguel.csv', sep = ';') #alocando os dados em uma variável para manipulação

In [4]:
dados.head(10) #Visualização dos dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

# Alguns problemas identificados

    Colunas que não podem ter valor nulo ou zerados : ['Valor']

    Se o tipo de imóvel for apartamento os dados da coluna 'Condominio' não podem ser nulos ou zero

## Tratamento dos dados na coluna 'Valor'

In [26]:
dados.isnull() #booleano de informações nulas

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False        True   True
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False  False
4      False   False    False  False   False  False  False       False   True
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
32955  False   False    False  False   False  False  False       False  False
32956  False   False    False  False   False  False  False       False  False
32957  False   False    False  False   False  False  False       False  False
32958  False   False    False  False   False  False  False       False   True
32959  False   False    False  False   False  False  False       False  False

[32943 rows x 9 columns]

In [27]:
dados.notnull() #booleano de informações não nulas

       Tipo  Bairro  Quartos  Vagas  Suites  Area  Valor  Condominio   IPTU
0      True    True     True   True    True  True   True        True   True
1      True    True     True   True    True  True   True       False  False
2      True    True     True   True    True  True   True        True   True
3      True    True     True   True    True  True   True        True   True
4      True    True     True   True    True  True   True        True  False
...     ...     ...      ...    ...     ...   ...    ...         ...    ...
32955  True    True     True   True    True  True   True        True   True
32956  True    True     True   True    True  True   True        True   True
32957  True    True     True   True    True  True   True        True   True
32958  True    True     True   True    True  True   True        True  False
32959  True    True     True   True    True  True   True        True   True

[32943 rows x 9 columns]

In [28]:
dados.info() #informações gerais do DataFrame

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32943 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32943 non-null  object
 1   Bairro      32943 non-null  object
 2   Quartos     32943 non-null  int64
 3   Vagas       32943 non-null  int64
 4   Suites      32943 non-null  int64
 5   Area        32943 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28854 non-null  float64
 8   IPTU        22716 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.5+ MB

In [29]:
dados[dados['Valor'].isnull()] #DataFrame apenas com a coluna 'valor' com valores nulos

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [30]:
# Eliminação do DataFrame os valores nulos da coluna 'Valor'
A = dados.shape[0]
dados.dropna(subset = ['Valor'], inplace = True)
B = dados.shape[0]

In [31]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

## Tratamento dos dados da coluna 'Condominio'

In [34]:
dados[dados['Condominio'].isnull()].shape[0] #Identificando a quantidade de imóveis com o condomínio nulo

4089

In [36]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull()) #Selecionando os apartamentos que estão com o condomínio com valor nulo

In [37]:
# Eliminação do DataFrame os valores nulos da seleção acima
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
A - B

745

In [38]:
dados[dados['Condominio'].isnull()].shape[0] #Vendo novamente os valores nulos na coluna 'Condomínio'

3344

## Tratamento dos dados que estão com o condomínio e IPTU nulo.
    Esse dados não serão eliminados por conterem informações importantes
    para serem considerados, vou considerar que os valores que são nulos agora serão preenchidos com valor 0

In [42]:
dados = dados.fillna({'Condominio': 0, 'IPTU': 0}) #Substituindo os valores nulos por 0

In [43]:
dados[dados['Condominio'].isnull()].shape[0]

0

In [44]:
dados[dados['IPTU'].isnull()].shape[0]

0

In [46]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32198 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32198 non-null  object
 1   Bairro      32198 non-null  object
 2   Quartos     32198 non-null  int64
 3   Vagas       32198 non-null  int64
 4   Suites      32198 non-null  int64
 5   Area        32198 non-null  int64
 6   Valor       32198 non-null  float64
 7   Condominio  32198 non-null  float64
 8   IPTU        32198 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.5+ MB

## Substituindo os dados do arquivo original pelos dados tratados.

In [47]:
dados.to_csv('dados/aluguel.csv', sep = ';', index = False)